Contents of the .eh_frame section (loaded from bomb):


00000000 0000000000000014 00000000 CIE
  Version:               1
  Augmentation:          "zR"
  Code alignment factor: 1
  Data alignment factor: -8
  Return address column: 16
  Augmentation data:     1b
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_offset: r16 (rip) at cfa-8
  DW_CFA_nop
  DW_CFA_nop

00000018 0000000000000024 0000001c FDE cie=00000000 pc=0000000000400ad0..0000000000400c90
  DW_CFA_def_cfa_offset: 16
  DW_CFA_advance_loc: 6 to 0000000000400ad6
  DW_CFA_def_cfa_offset: 24
  DW_CFA_advance_loc: 10 to 0000000000400ae0
  DW_CFA_def_cfa_expression (DW_OP_breg7 (rsp): 8; DW_OP_breg16 (rip): 0; DW_OP_lit15; DW_OP_and; DW_OP_lit11; DW_OP_ge; DW_OP_lit3; DW_OP_shl; DW_OP_plus)
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000040 000000000000001c 00000044 FDE cie=00000000 pc=0000000000400da0..0000000000400ed7
  DW_CFA_advance_loc: 1 to 0000000000400da1
  DW_CFA_def_cfa_offset: 16
  DW_CFA_offset: r3 (rbx) at cfa-16
  DW_CFA_advance_loc2: 309 to 0000000000400ed6
  DW_CFA_def_cfa_offset: 8
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000060 0000000000000014 00000064 FDE cie=00000000 pc=0000000000400ee0..0000000000400efc
  DW_CFA_advance_loc: 4 to 0000000000400ee4
  DW_CFA_def_cfa_offset: 16
  DW_CFA_advance_loc: 23 to 0000000000400efb
  DW_CFA_def_cfa_offset: 8
  DW_CFA_nop

00000078 0000000000000024 0000007c FDE cie=00000000 pc=0000000000400efc..0000000000400f43

  DW_CFA_advance_loc2: 460 to 000000000040218a
  DW_CFA_def_cfa_offset: 24
  DW_CFA_advance_loc: 1 to 000000000040218b
  DW_CFA_def_cfa_offset: 16
  DW_CFA_advance_loc: 1 to 000000000040218c
  DW_CFA_def_cfa_offset: 8
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

000003f0 000000000000001c 000003f4 FDE cie=00000000 pc=000000000040218d..0000000000402204
  DW_CFA_advance_loc: 1 to 000000000040218e
  DW_CFA_def_cfa_offset: 16
  DW_CFA_offset: r3 (rbx) at cfa-16
  DW_CFA_advance_loc: 4 to 0000000000402192
  DW_CFA_def_cfa_offset: 32
  DW_CFA_advance_loc1: 112 to 0000000000402202
  DW_CFA_def_cfa_offset: 16
  DW_CFA_advance_loc: 1 to 0000000000402203
  DW_CFA_def_cfa_offset: 8

00000410 0000000000000024 00000414 FDE cie=00000000 pc=0000000000402210..0000000000402299
  DW_CFA_advance_loc: 17 to 0000000000402221
  DW_CFA_offset: r12 (r12) at cfa-40
  DW_CFA_offset: r6 (rbp) at cfa-48
  DW_CFA_advance_loc: 31 to 0000000000402240
  DW_CFA_def_cfa_offset: 64
  DW_CFA_offset: r3 (rbx) at cfa-56
  DW_CFA_offset: r15 (r15) at cfa-16
  DW_CFA_offset: r14 (r14) at cfa-24
  DW_CFA_offset: r13 (r13) at cfa-32
  DW_CFA_advance_loc1: 88 to 0000000000402298
  DW_CFA_def_cfa_offset: 8
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000438 0000000000000014 0000043c FDE cie=00000000 pc=00000000004022a0..00000000004022a2
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000450 ZERO terminator


Contents of the .debug_aranges section (loaded from bomb):

  Length:                   44
  Version:                  2
  Offset into .debug_info:  0x0
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    0000000000400da0 0000000000000137 
    0000000000000000 0000000000000000 

Contents of the .debug_info section (loaded from bomb):

  Compilation Unit @ offset 0x0:
   Length:        0x79f (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  8
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x151): GNU C 4.8.1 -mtune=generic -march=x86-64 -ggdb -O1 -fstack-protector
    <10>   DW_AT_language    : 1	(ANSI C)
    <11>   DW_AT_name        : (indirect string, offset: 0x22b): bomb.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x62): /usr0/home/droh/ics3/im/labs/bomblab/src
    <19>   DW_AT_low_pc      : 0x400da0
    <21>   DW_AT_high_pc     : 0x137
    <29>   DW_AT_stmt_list   : 0x0
 <1><2d>: Abbrev Number: 2 (DW_TAG_typedef)
    <2e>   DW_AT_name        : (indirect string, offset: 0x23): size_t
    <32>   DW_AT_decl_file   : 3
    <33>   DW_AT_decl_line   : 212
    <34>   DW_AT_type        : <0x38>
 <1><38>: Abbrev Number: 3 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 8
    <3a>   DW_AT_encoding    : 7	(unsigned)
    <3b>   DW_AT_name        : (indirect string, offset: 0x46): long unsigned int
 <1><3f>: Abbrev Number: 3 (DW_TAG_base_type)
    <40>   DW_AT_byte_size   : 1
    <41>   DW_AT_encoding    : 8	(unsigned char)
    <42>   DW_AT_name        : (indirect string, offset: 0x1ff): unsigned char
 <1><46>: Abbrev Number: 3 (DW_TAG_base_type)
    <47>   DW_AT_byte_size   : 2
    <48>   DW_AT_encoding    : 7	(unsigned)
    <49>   DW_AT_name        : (indirect string, offset: 0x130): short unsigned int
 <1><4d>: Abbrev Number: 3 (DW_TAG_base_type)
    <4e>   DW_AT_byte_size   : 4
    <4f>   DW_AT_encoding    : 7	(unsigned)
    <50>   DW_AT_name        : (indirect string, offset: 0x4b): unsigned int
 <1><54>: Abbrev Number: 3 (DW_TAG_base_type)
    <55>   DW_AT_byte_size   : 1
    <56>   DW_AT_encoding    : 6	(signed char)
    <57>   DW_AT_name        : (indirect string, offset: 0x201): signed char
 <1><5b>: Abbrev Number: 3 (DW_TAG_base_type)
    <5c>   DW_AT_byte_size   : 2
    <5d>   DW_AT_encoding    : 5	(signed)
    <5e>   DW_AT_name        : (indirect string, offset: 0x20d): short int
 <1><62>: Abbrev Number: 4 (DW_TAG_base_type)
    <63>   DW_AT_byte_size   : 4
    <64>   DW_AT_encoding    : 5	(signed)
    <65>   DW_AT_name        : int
 <1><69>: Abbrev Number: 3 (DW_TAG_base_type)
    <6a>   DW_AT_byte_size   : 8
    <6b>   DW_AT_encoding    : 5	(signed)
    <6c>   DW_AT_name        : (indirect string, offset: 0x90): long int
 <1><70>: Abbrev Number: 2 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x7): __off_t
    <75>   DW_AT_decl_file   : 4
    <76>   DW_AT_decl_line   : 141
    <77>   DW_AT_type        : <0x69>
 <1><7b>: Abbrev Number: 2 (DW_TAG_typedef)
    <7c>   DW_AT_name        : (indirect string, offset: 0x23e): __off64_t
    <80>   DW_AT_decl_file   : 4
    <81>   DW_AT_decl_line   : 142
    <82>   DW_AT_type        : <0x69>
 <1><86>: Abbrev Number: 3 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 8
    <88>   DW_AT_encoding    : 7	(unsigned)
    <89>   DW_AT_name        : (indirect string, offset: 0x1c0): sizetype
 <1><8d>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <8e>   DW_AT_byte_size   : 8
 <1><8f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <90>   DW_AT_byte_size   : 8
    <91>   DW_AT_type        : <0x95>
 <1><95>: Abbrev Number: 3 (DW_TAG_base_type)
    <96>   DW_AT_byte_size   : 1
    <97>   DW_AT_encoding    : 6	(signed char)
    <98>   DW_AT_name        : (indirect string, offset: 0x208): char
 <1><9c>: Abbrev Number: 2 (DW_TAG_typedef)
    <9d>   DW_AT_name        : (indirect string, offset: 0x1e6): FILE
    <a1>   DW_AT_decl_file   : 5
    <a2>   DW_AT_decl_line   : 49
    <a3>   DW_AT_type        : <0xa7>
 <1><a7>: Abbrev Number: 7 (DW_TAG_structure_type)
    <a8>   DW_AT_name        : (indirect string, offset: 0x1e2): _IO_FILE
    <ac>   DW_AT_byte_size   : 216
    <ad>   DW_AT_decl_file   : 6
    <ae>   DW_AT_decl_line   : 273
    <b0>   DW_AT_sibling     : <0x22e>
 <2><b4>: Abbrev Number: 8 (DW_TAG_member)
    <b5>   DW_AT_name        : (indirect string, offset: 0xbc): _flags
    <b9>   DW_AT_decl_file   : 6
    <ba>   DW_AT_decl_line   : 274
    <bc>   DW_AT_type        : <0x62>
    <c0>   DW_AT_data_member_location: 0
 <2><c1>: Abbrev Number: 8 (DW_TAG_member)
    <c2>   DW_AT_name        : (indirect string, offset: 0xf): _IO_read_ptr
    <c6>   DW_AT_decl_file   : 6
    <c7>   DW_AT_decl_line   : 279
    <c9>   DW_AT_type        : <0x8f>
    <cd>   DW_AT_data_member_location: 8
 <2><ce>: Abbrev Number: 8 (DW_TAG_member)
    <cf>   DW_AT_name        : (indirect string, offset: 0xaf): _IO_read_end
    <d3>   DW_AT_decl_file   : 6
    <d4>   DW_AT_decl_line   : 280
    <d6>   DW_AT_type        : <0x8f>
    <da>   DW_AT_data_member_location: 16
 <2><db>: Abbrev Number: 8 (DW_TAG_member)
    <dc>   DW_AT_name        : (indirect string, offset: 0x248): _IO_read_base
    <e0>   DW_AT_decl_file   : 6
    <e1>   DW_AT_decl_line   : 281
    <e3>   DW_AT_type        : <0x8f>
    <e7>   DW_AT_data_member_location: 24
 <2><e8>: Abbrev Number: 8 (DW_TAG_member)
    <e9>   DW_AT_name        : (indirect string, offset: 0x2e4): _IO_write_base
    <ed>   DW_AT_decl_file   : 6
    <ee>   DW_AT_decl_line   : 282
    <f0>   DW_AT_type        : <0x8f>
    <f4>   DW_AT_data_member_location: 32
 <2><f5>: Abbrev Number: 8 (DW_TAG_member)
    <f6>   DW_AT_name        : (indirect string, offset: 0x11c): _IO_write_ptr
    <fa>   DW_AT_decl_file   : 6
    <fb>   DW_AT_decl_line   : 283
    <fd>   DW_AT_type        : <0x8f>
    <101>   DW_AT_data_member_location: 40
 <2><102>: Abbrev Number: 8 (DW_TAG_member)
    <103>   DW_AT_name        : (indirect string, offset: 0x1c9): _IO_write_end
    <107>   DW_AT_decl_file   : 6
    <108>   DW_AT_decl_line   : 284
    <10a>   DW_AT_type        : <0x8f>
    <10e>   DW_AT_data_member_location: 48
 <2><10f>: Abbrev Number: 8 (DW_TAG_member)
    <110>   DW_AT_name        : (indirect string, offset: 0x34): _IO_buf_base
    <114>   DW_AT_decl_file   : 6
    <115>   DW_AT_decl_line   : 285
    <117>   DW_AT_type        : <0x8f>
    <11b>   DW_AT_data_member_location: 56
 <2><11c>: Abbrev Number: 8 (DW_TAG_member)
    <11d>   DW_AT_name        : (indirect string, offset: 0xc3): _IO_buf_end
    <121>   DW_AT_decl_file   : 6
    <122>   DW_AT_decl_line   : 286
    <124>   DW_AT_type        : <0x8f>
    <128>   DW_AT_data_member_location: 64
 <2><129>: Abbrev Number: 8 (DW_TAG_member)
    <12a>   DW_AT_name        : (indirect string, offset: 0x143): _IO_save_base
    <12e>   DW_AT_decl_file   : 6
    <12f>   DW_AT_decl_line   : 288
    <131>   DW_AT_type        : <0x8f>
    <135>   DW_AT_data_member_location: 72
 <2><136>: Abbrev Number: 8 (DW_TAG_member)
    <137>   DW_AT_name        : (indirect string, offset: 0x2ca): _IO_backup_base
    <13b>   DW_AT_decl_file   : 6
    <13c>   DW_AT_decl_line   : 289
    <13e>   DW_AT_type        : <0x8f>
    <142>   DW_AT_data_member_location: 80
 <2><143>: Abbrev Number: 8 (DW_TAG_member)
    <144>   DW_AT_name        : (indirect string, offset: 0x256): _IO_save_end
    <148>   DW_AT_decl_file   : 6
    <149>   DW_AT_decl_line   : 290
    <14b>   DW_AT_type        : <0x8f>
    <14f>   DW_AT_data_member_location: 88
 <2><150>: Abbrev Number: 8 (DW_TAG_member)
    <151>   DW_AT_name        : (indirect string, offset: 0x1f6): _markers
    <155>   DW_AT_decl_file   : 6
    <156>   DW_AT_decl_line   : 292
    <158>   DW_AT_type        : <0x266>
    <15c>   DW_AT_data_member_location: 96
 <2><15d>: Abbrev Number: 8 (DW_TAG_member)
    <15e>   DW_AT_name        : (indirect string, offset: 0x1c): _chain
    <162>   DW_AT_decl_file   : 6
    <163>   DW_AT_decl_line   : 294
    <165>   DW_AT_type        : <0x26c>
    <169>   DW_AT_data_member_location: 104
 <2><16a>: Abbrev Number: 8 (DW_TAG_member)
    <16b>   DW_AT_name        : (indirect string, offset: 0xa7): _fileno
    <16f>   DW_AT_decl_file   : 6
    <170>   DW_AT_decl_line   : 296
    <172>   DW_AT_type        : <0x62>
    <176>   DW_AT_data_member_location: 112
 <2><177>: Abbrev Number: 8 (DW_TAG_member)
    <178>   DW_AT_name        : (indirect string, offset: 0x19c): _flags2
    <17c>   DW_AT_decl_file   : 6
    <17d>   DW_AT_decl_line   : 300
    <17f>   DW_AT_type        : <0x62>
    <183>   DW_AT_data_member_location: 116
 <2><184>: Abbrev Number: 8 (DW_TAG_member)
    <185>   DW_AT_name        : (indirect string, offset: 0xe8): _old_offset
    <189>   DW_AT_decl_file   : 6
    <18a>   DW_AT_decl_line   : 302
    <18c>   DW_AT_type        : <0x70>
    <190>   DW_AT_data_member_location: 120
 <2><191>: Abbrev Number: 8 (DW_TAG_member)
    <192>   DW_AT_name        : (indirect string, offset: 0xcf): _cur_column
    <196>   DW_AT_decl_file   : 6
    <197>   DW_AT_decl_line   : 306
    <199>   DW_AT_type        : <0x46>
    <19d>   DW_AT_data_member_location: 128
 <2><19e>: Abbrev Number: 8 (DW_TAG_member)
    <19f>   DW_AT_name        : (indirect string, offset: 0x217): _vtable_offset
    <1a3>   DW_AT_decl_file   : 6
    <1a4>   DW_AT_decl_line   : 307
    <1a6>   DW_AT_type        : <0x54>
    <1aa>   DW_AT_data_member_location: 130
 <2><1ab>: Abbrev Number: 8 (DW_TAG_member)
    <1ac>   DW_AT_name        : (indirect string, offset: 0x2a): _shortbuf
    <1b0>   DW_AT_decl_file   : 6
    <1b1>   DW_AT_decl_line   : 308
    <1b3>   DW_AT_type        : <0x272>
    <1b7>   DW_AT_data_member_location: 131
 <2><1b8>: Abbrev Number: 8 (DW_TAG_member)
    <1b9>   DW_AT_name        : (indirect string, offset: 0x196): _lock
    <1bd>   DW_AT_decl_file   : 6
    <1be>   DW_AT_decl_line   : 312
    <1c0>   DW_AT_type        : <0x282>
    <1c4>   DW_AT_data_member_location: 136
 <2><1c5>: Abbrev Number: 8 (DW_TAG_member)
    <1c6>   DW_AT_name        : (indirect string, offset: 0xec): _offset
    <1ca>   DW_AT_decl_file   : 6
    <1cb>   DW_AT_decl_line   : 321
    <1cd>   DW_AT_type        : <0x7b>
    <1d1>   DW_AT_data_member_location: 144
 <2><1d2>: Abbrev Number: 8 (DW_TAG_member)
    <1d3>   DW_AT_name        : (indirect string, offset: 0x269): __pad1
    <1d7>   DW_AT_decl_file   : 6
    <1d8>   DW_AT_decl_line   : 330
    <1da>   DW_AT_type        : <0x8d>
    <1de>   DW_AT_data_member_location: 152
 <2><1df>: Abbrev Number: 8 (DW_TAG_member)
    <1e0>   DW_AT_name        : (indirect string, offset: 0x270): __pad2
    <1e4>   DW_AT_decl_file   : 6
    <1e5>   DW_AT_decl_line   : 331
    <1e7>   DW_AT_type        : <0x8d>
    <1eb>   DW_AT_data_member_location: 160
 <2><1ec>: Abbrev Number: 8 (DW_TAG_member)
    <1ed>   DW_AT_name        : (indirect string, offset: 0x277): __pad3
    <1f1>   DW_AT_decl_file   : 6
    <1f2>   DW_AT_decl_line   : 332
    <1f4>   DW_AT_type        : <0x8d>
    <1f8>   DW_AT_data_member_location: 168
 <2><1f9>: Abbrev Number: 8 (DW_TAG_member)
    <1fa>   DW_AT_name        : (indirect string, offset: 0x27e): __pad4
    <1fe>   DW_AT_decl_file   : 6
    <1ff>   DW_AT_decl_line   : 333
    <201>   DW_AT_type        : <0x8d>
    <205>   DW_AT_data_member_location: 176
 <2><206>: Abbrev Number: 8 (DW_TAG_member)
    <207>   DW_AT_name        : (indirect string, offset: 0x285): __pad5
    <20b>   DW_AT_decl_file   : 6
    <20c>   DW_AT_decl_line   : 334
    <20e>   DW_AT_type        : <0x2d>
    <212>   DW_AT_data_member_location: 184
 <2><213>: Abbrev Number: 8 (DW_TAG_member)
    <214>   DW_AT_name        : (indirect string, offset: 0x1a4): _mode
    <218>   DW_AT_decl_file   : 6
    <219>   DW_AT_decl_line   : 336
    <21b>   DW_AT_type        : <0x62>
    <21f>   DW_AT_data_member_location: 192
 <2><220>: Abbrev Number: 8 (DW_TAG_member)
    <221>   DW_AT_name        : (indirect string, offset: 0x28c): _unused2
    <225>   DW_AT_decl_file   : 6
    <226>   DW_AT_decl_line   : 338
    <228>   DW_AT_type        : <0x288>
    <22c>   DW_AT_data_member_location: 196
 <2><22d>: Abbrev Number: 0
 <1><22e>: Abbrev Number: 9 (DW_TAG_typedef)
    <22f>   DW_AT_name        : (indirect string, offset: 0x1d7): _IO_lock_t
    <233>   DW_AT_decl_file   : 6
    <234>   DW_AT_decl_line   : 182
 <1><235>: Abbrev Number: 10 (DW_TAG_structure_type)
    <236>   DW_AT_name        : (indirect string, offset: 0x10b): _IO_marker
    <23a>   DW_AT_byte_size   : 24
    <23b>   DW_AT_decl_file   : 6
    <23c>   DW_AT_decl_line   : 188
    <23d>   DW_AT_sibling     : <0x266>
 <2><241>: Abbrev Number: 11 (DW_TAG_member)
    <242>   DW_AT_name        : (indirect string, offset: 0x238): _next
    <246>   DW_AT_decl_file   : 6
    <247>   DW_AT_decl_line   : 189
    <248>   DW_AT_type        : <0x266>
    <24c>   DW_AT_data_member_location: 0
 <2><24d>: Abbrev Number: 11 (DW_TAG_member)
    <24e>   DW_AT_name        : (indirect string, offset: 0x12a): _sbuf
    <252>   DW_AT_decl_file   : 6
    <253>   DW_AT_decl_line   : 190
    <254>   DW_AT_type        : <0x26c>
    <258>   DW_AT_data_member_location: 8
 <2><259>: Abbrev Number: 11 (DW_TAG_member)
    <25a>   DW_AT_name        : (indirect string, offset: 0x1f1): _pos
    <25e>   DW_AT_decl_file   : 6
    <25f>   DW_AT_decl_line   : 194
    <260>   DW_AT_type        : <0x62>
    <264>   DW_AT_data_member_location: 16
 <2><265>: Abbrev Number: 0
 <1><266>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <267>   DW_AT_byte_size   : 8
    <268>   DW_AT_type        : <0x235>
 <1><26c>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <26d>   DW_AT_byte_size   : 8
    <26e>   DW_AT_type        : <0xa7>
 <1><272>: Abbrev Number: 12 (DW_TAG_array_type)
    <273>   DW_AT_type        : <0x95>
    <277>   DW_AT_sibling     : <0x282>
 <2><27b>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <27c>   DW_AT_type        : <0x86>
    <280>   DW_AT_upper_bound : 0
 <2><281>: Abbrev Number: 0
 <1><282>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <283>   DW_AT_byte_size   : 8
    <284>   DW_AT_type        : <0x22e>
 <1><288>: Abbrev Number: 12 (DW_TAG_array_type)
    <289>   DW_AT_type        : <0x95>
    <28d>   DW_AT_sibling     : <0x298>
 <2><291>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <292>   DW_AT_type        : <0x86>
    <296>   DW_AT_upper_bound : 19
 <2><297>: Abbrev Number: 0
 <1><298>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <299>   DW_AT_byte_size   : 8
    <29a>   DW_AT_type        : <0x29e>
 <1><29e>: Abbrev Number: 14 (DW_TAG_const_type)
    <29f>   DW_AT_type        : <0x95>
 <1><2a3>: Abbrev Number: 3 (DW_TAG_base_type)
    <2a4>   DW_AT_byte_size   : 8
    <2a5>   DW_AT_encoding    : 5	(signed)
    <2a6>   DW_AT_name        : (indirect string, offset: 0x8b): long long int
 <1><2aa>: Abbrev Number: 3 (DW_TAG_base_type)
    <2ab>   DW_AT_byte_size   : 8
    <2ac>   DW_AT_encoding    : 7	(unsigned)
    <2ad>   DW_AT_name        : (indirect string, offset: 0x41): long long unsigned int
 <1><2b1>: Abbrev Number: 15 (DW_TAG_subprogram)
    <2b2>   DW_AT_external    : 1
    <2b2>   DW_AT_name        : (indirect string, offset: 0x0): printf
    <2b6>   DW_AT_decl_file   : 2
    <2b7>   DW_AT_decl_line   : 103
    <2b8>   DW_AT_prototyped  : 1
    <2b8>   DW_AT_type        : <0x62>
    <2bc>   DW_AT_inline      : 3	(declared as inline and inlined)
    <2bd>   DW_AT_artificial  : 1
    <2bd>   DW_AT_sibling     : <0x2ce>
 <2><2c1>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <2c2>   DW_AT_name        : (indirect string, offset: 0x263): __fmt
    <2c6>   DW_AT_decl_file   : 2
    <2c7>   DW_AT_decl_line   : 103
    <2c8>   DW_AT_type        : <0x298>
 <2><2cc>: Abbrev Number: 17 (DW_TAG_unspecified_parameters)
 <2><2cd>: Abbrev Number: 0
 <1><2ce>: Abbrev Number: 18 (DW_TAG_subprogram)
    <2cf>   DW_AT_external    : 1
    <2cf>   DW_AT_name        : (indirect string, offset: 0x2df): main
    <2d3>   DW_AT_decl_file   : 1
    <2d4>   DW_AT_decl_line   : 36
    <2d5>   DW_AT_prototyped  : 1
    <2d5>   DW_AT_type        : <0x62>
    <2d9>   DW_AT_low_pc      : 0x400da0
    <2e1>   DW_AT_high_pc     : 0x137
    <2e9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <2eb>   DW_AT_GNU_all_call_sites: 1
    <2eb>   DW_AT_sibling     : <0x68f>
 <2><2ef>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <2f0>   DW_AT_name        : (indirect string, offset: 0x2da): argc
    <2f4>   DW_AT_decl_file   : 1
    <2f5>   DW_AT_decl_line   : 36
    <2f6>   DW_AT_type        : <0x62>
    <2fa>   DW_AT_location    : 0x0 (location list)
 <2><2fe>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <2ff>   DW_AT_name        : (indirect string, offset: 0x295): argv
    <303>   DW_AT_decl_file   : 1
    <304>   DW_AT_decl_line   : 36
    <305>   DW_AT_type        : <0x68f>
    <309>   DW_AT_location    : 0x62 (location list)
 <2><30d>: Abbrev Number: 20 (DW_TAG_variable)
    <30e>   DW_AT_name        : (indirect string, offset: 0x232): input
    <312>   DW_AT_decl_file   : 1
    <313>   DW_AT_decl_line   : 38
    <314>   DW_AT_type        : <0x8f>
    <318>   DW_AT_location    : 0xae (location list)
 <2><31c>: Abbrev Number: 21 (DW_TAG_inlined_subroutine)
    <31d>   DW_AT_abstract_origin: <0x2b1>
    <321>   DW_AT_low_pc      : 0x400dd8
    <329>   DW_AT_high_pc     : 0x16
    <331>   DW_AT_call_file   : 1
